a9 = True

while a9:

    print("Меню Функций:")

    print("Калькулятор - 1")

    print("Калькулятор уравнений - 2")

    print("Найти количество символов в тексте - 3")

    print("Перевод предложения в правильный вид - 4")

    print("Угадай число - 5")

    a1 = int(input("Введите номер функции: "))

    if a1 == 1:

        a2 = input("Выберете мат. действие: ")

        if a2 == "+":

            a3 = int(input("Введите первое слогаемое: "))

            a4 = int(input("Введите второе слогаемое: "))

            print("Результат: ", a3 + a4)

        elif a2 == "-":

            a3 = int(input("Введите уменьшаемое: "))

            a4 = int(input("Введите вычетаемое: "))

            print("Результат: ", a3 - a4)

        elif a2 == "*":

            a3 = int(input("Введите множитель 1: "))

            a4 = int(input("Введите множитель 2: "))

            print("Результат: ", a3 * a4)

        elif a2 == "/":

            a3 = int(input("Введите делимое: "))

            a4 = int(input("Введите делитель: "))

            print("Результат: ", a3 / a4)

    if a1 == 2:

        print("Привет!Это решатор уравнений,")

        print("Нумерация строения уравнений(n-обыч число,x-корень):")

        print("n + x = n        #1")

        print("x + n = n        #2")

        print("n - x = n        #3")

        print("x - n = n        #4")

        print("n * x = n        #5")

        print("x * n = n        #6")

        print("n / x = n        #7")

        print("n % x = n        #8")

        a2 = int(input("Введите # строения уравнения: "))

        if a2 == 1:  # +

            a3 = int(input("Введите частицу n уравнения(n + _ = _): "))

            a4 = int(input("Введите частицу n уравнения(_ + _ = n): "))

            print("x =", a4 - a3, )

        elif a2 == 2:

            a3 = int(input("Введите частицу n уравнения(_ + n = _): "))

            a4 = int(input("Введите частицу n уравнения(_ + _ = n): "))

            print("x =", a4 - a3, )

        elif a2 == 3:  # -

            a3 = int(input("Введите частицу n уравнения(n - _ = _): "))

            a4 = int(input("Введите частицу n уравнения(_ - _ = n): "))

            print("x =", a4 - a3, )

        elif a2 == 4:

            a3 = int(input("Введите частицу n уравнения(_ - n = _): "))

            a4 = int(input("Введите частицу n уравнения(_ - _ = n): "))

            print("x =", a3 + a4, )

        elif a2 == 5:  # *

            a3 = int(input("Введите частицу n уравнения(n * _ = _): "))

            a4 = int(input("Введите частицу n уравнения(_ * _ = n): "))

            print("x =", a4 / a3, )

        elif a2 == 6:

            a3 = int(input("Введите частицу n уравнения(_ * n = _): "))

            a4 = int(input("Введите частицу n уравнения(_ * _ = n): "))

            print("x =", a4 / a3, )

        elif a2 == 7:  # /

            a3 = int(input("Введите частицу n уравнения(n / _ = _): "))

            a4 = int(input("Введите частицу n уравнения(_ / _ = n): "))

            print("x =", a3 / a4, )

        elif a2 == 8:

            a3 = int(input("Введите частицу n уравнения(_ / n = _): "))

            a4 = int(input("Введите частицу n уравнения(_ / _ = n): "))

            print("x =", a3 * a4, )

        else:

            print("Не корректный номер формы!")

    if a1 == 3:

        a2 = input("Введите текст: ")

        a3 = input("Введите символ для поиска: ")

        print("результат: ",a2.count(a3))

    if a1 == 4:

        a2 = input("Введите предложение: ")

        print("Результат: ", a2.capitalize())

    if a1 == 5:

        l1 = int(input("Введите число(счет идет от нуля до ста)"))

        print("Ваш друг загадал число,попробуйте его угадать.")

        while True:

            l2 = int(input("Введите число: "))

            if l2 == a1:

                print("Вы нашли правильное число!!!")

                break

            elif l2 >= l1 + 1:

                print("Загадоное число меньше!")

            elif l2 <= l1 - 1:
                print("Загадоное число больше!")
            file = open('data/text.txt','a')
            file.write(l1,'\n',l2,'\n')
            file.close()
    file = open('data/text.txt','a')
    file.write(str(a2) + str('\n') + str(a2) + str('\n') + str(a3) + str('\n') + str(a4) + str('\n'))
    file.close()